Revit 2025 API
Zone.AddSpaces Method
Add a set of existing spaces to Zone element.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public bool AddSpaces(
	SpaceSet spaces
)
Public Function AddSpaces (
	spaces As SpaceSet
) As Boolean
public:
bool AddSpaces(
	SpaceSet^ spaces
)
member AddSpaces :
        spaces : SpaceSet -> bool
Parameters
spaces SpaceSet
 The spaces which want to add to zone element.
Return Value
Boolean
 If successful the current zone element will add a set of input spaces, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the specified parameter Value is null.
InvalidOperationException |  Thrown when the input spaces cannot be added to current zone element.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace